RT-Thread/rt-thread/bsp/imxrt1052-evk/drivers/drv_eth.c
}

static void _enet_clk_init(void)
{
    const clock_enet_pll_config_t config = {true, false, false, 1, 1};
    CLOCK_InitEnetPll(&config);
    
    IOMUXC_EnableMode(IOMUXC_GPR, kIOMUXC_GPR_ENET1TxClkOutputDir, true);
}

static void _delay(void)
{
    volatile int i = 1000000;
    
    while (i--)
        i = i;
}

static void _enet_phy_reset_by_gpio(void)
{
    gpio_pin_config_t gpio_config = {kGPIO_DigitalOutput, 0, kGPIO_NoIntmode};
    
    GPIO_PinInit(GPIO1, 9, &gpio_config);
    GPIO_PinInit(GPIO1, 10, &gpio_config);
    /* pull up the ENET_INT before RESET. */
    GPIO_WritePinOutput(GPIO1, 10, 1);
    GPIO_WritePinOutput(GPIO1, 9, 0);
    _delay();
    GPIO_WritePinOutput(GPIO1, 9, 1);
}

static void _enet_config(void)
{
    enet_config_t config;
    uint32_t sysClock;
    status_t status;
    phy_speed_t speed;
    phy_duplex_t duplex;
    bool link = false;
    
    /* prepare the buffer configuration. */
    enet_buffer_config_t buffConfig = {
        ENET_RXBD_NUM,
        ENET_TXBD_NUM,
        SDK_SIZEALIGN(ENET_RXBUFF_SIZE, ENET_BUFF_ALIGNMENT),
        SDK_SIZEALIGN(ENET_TXBUFF_SIZE, ENET_BUFF_ALIGNMENT),
        &g_rxBuffDescrip[0],
        &g_txBuffDescrip[0],
        &g_rxDataBuff[0][0],
        &g_txDataBuff[0][0],
    };
    
    /* Get default configuration. */
    /*
     * config.miiMode = kENET_RmiiMode;
     * config.miiSpeed = kENET_MiiSpeed100M;
     * config.miiDuplex = kENET_MiiFullDuplex;
     * config.rxMaxFrameLen = ENET_FRAME_MAX_FRAMELEN;
     */
    ENET_GetDefaultConfig(&config);
    config.interrupt = kENET_TxFrameInterrupt | kENET_RxFrameInterrupt;
    //config.interrupt = 0xFFFFFFFF;
    
    /* Set SMI to get PHY link status. */
    sysClock = CLOCK_GetFreq(kCLOCK_AhbClk);
    status = PHY_Init(imxrt_eth_device.enet_base, PHY_ADDRESS, sysClock);
    while (status != kStatus_Success)
    {
        ETH_PRINTF("\r\nPHY Auto-negotiation failed. Please check the cable connection and link partner setting.\r\n");
        status = PHY_Init(imxrt_eth_device.enet_base, PHY_ADDRESS, sysClock);
    }
    
    PHY_GetLinkStatus(imxrt_eth_device.enet_base, PHY_ADDRESS, &link);
    if (link)
    {
        /* Get the actual PHY link speed. */
        PHY_GetLinkSpeedDuplex(imxrt_eth_device.enet_base, PHY_ADDRESS, &speed, &duplex);
        /* Change the MII speed and duplex for actual link status. */
        config.miiSpeed = (enet_mii_speed_t)speed;
        config.miiDuplex = (enet_mii_duplex_t)duplex;
    } 
    
    ENET_Init(imxrt_eth_device.enet_base, &imxrt_eth_device.enet_handle, &config, &buffConfig, &imxrt_eth_device.dev_addr[0], sysClock);
    ENET_SetCallback(&imxrt_eth_device.enet_handle, _enet_callback, &imxrt_eth_device);
    ENET_ActiveRead(imxrt_eth_device.enet_base);
}

/* initialize the interface */
static rt_err_t rt_imxrt_eth_init(rt_device_t dev)
{
    _enet_io_init();
    _enet_clk_init();
    _enet_phy_reset_by_gpio();
    
    _enet_config();

    return RT_EOK;
}

static rt_err_t rt_imxrt_eth_open(rt_device_t dev, rt_uint16_t oflag)
{
    ETH_PRINTF("rt_imxrt_eth_open...\n");
	return RT_EOK;
}

static rt_err_t rt_imxrt_eth_close(rt_device_t dev)
{
    ETH_PRINTF("rt_imxrt_eth_close...\n");
	return RT_EOK;
}

static rt_size_t rt_imxrt_eth_read(rt_device_t dev, rt_off_t pos, void* buffer, rt_size_t size)
{
    ETH_PRINTF("rt_imxrt_eth_read...\n");
	rt_set_errno(-RT_ENOSYS);
	return 0;
}

static rt_size_t rt_imxrt_eth_write (rt_device_t dev, rt_off_t pos, const void* buffer, rt_size_t size)
{
    ETH_PRINTF("rt_imxrt_eth_write...\n");
	rt_set_errno(-RT_ENOSYS);
	return 0;
}

static rt_err_t rt_imxrt_eth_control(rt_device_t dev, int cmd, void *args)
{
    ETH_PRINTF("rt_imxrt_eth_control...\n");
	switch(cmd)
	{
	case NIOCTL_GADDR:
		/* get mac address */
		if(args) rt_memcpy(args, imxrt_eth_device.dev_addr, 6);
		else return -RT_ERROR;
		break;

	default :
		break;
	}

	return RT_EOK;
}

/* ethernet device interface */
/* transmit packet. */
rt_err_t rt_imxrt_eth_tx( rt_device_t dev, struct pbuf* p)
{
	rt_err_t result = RT_EOK;
	enet_handle_t * enet_handle = &imxrt_eth_device.enet_handle;

	RT_ASSERT(p != NULL);
    RT_ASSERT(enet_handle != RT_NULL);

	ETH_PRINTF("rt_imxrt_eth_tx: %d\n", p->len);

#ifdef ETH_TX_DUMP
	{
		int i;
		uint8_t * buf;
		buf = (uint8_t *)p->payload;
		for (i = 0; i < p->len; i++)
		{
			ETH_PRINTF("%02X ", buf[i]);
			if (i % 16 == 15)
				ETH_PRINTF("\n");
		}
		ETH_PRINTF("\n");
	}
#endif

	do
	{
		result = ENET_SendFrame(imxrt_eth_device.enet_base, enet_handle, p->payload, p->len);

		if (result == kStatus_ENET_TxFrameBusy)
		{
			rt_sem_take(&imxrt_eth_device.tx_wait, RT_WAITING_FOREVER);
		}

	} while (result == kStatus_ENET_TxFrameBusy);

	return RT_EOK;
}

/* reception packet. */
struct pbuf *rt_imxrt_eth_rx(rt_device_t dev)
{
 	uint32_t length = 0;
	status_t status;
    
	struct pbuf* p = RT_NULL;
	enet_handle_t * enet_handle = &imxrt_eth_device.enet_handle;
    ENET_Type *enet_base = imxrt_eth_device.enet_base;
    enet_data_error_stats_t *error_statistic = &imxrt_eth_device.error_statistic;
    
	/* Get the Frame size */
	status = ENET_GetRxFrameSize(enet_handle, &length);

	/* Call ENET_ReadFrame when there is a received frame. */
	if (length != 0)
	{
		/* Received valid frame. Deliver the rx buffer with the size equal to length. */
		p = pbuf_alloc(PBUF_RAW, length, PBUF_POOL);
        
        if (p != NULL)
        {
            status = ENET_ReadFrame(enet_base, enet_handle, p->payload, length);
            if (status == kStatus_Success)
            {
    #ifdef ETH_RX_DUMP
                uint8_t *buf;
                int i;

                ETH_PRINTF("A frame received. the length:%d\n", p->len);
                buf = (uint8_t *)p->payload;
                for (i = 0; i < p->len; i++)
                {
                    ETH_PRINTF("%02X ", buf[i]);
                    if (i % 16 == 15)
                        ETH_PRINTF("\n");
                }
                ETH_PRINTF("\n");
    #endif
                return p;
            }
            else
            {
                ETH_PRINTF(" A frame read failed\n");
                pbuf_free(p);
            }
        }
        else
        {
            ETH_PRINTF(" pbuf_alloc faild\n");
        }
	}
	else if (status == kStatus_ENET_RxFrameError)
	{
		ETH_PRINTF("ENET_GetRxFrameSize: kStatus_ENET_RxFrameError\n");
		/* Update the received buffer when error happened. */
		/* Get the error information of the received g_frame. */
		ENET_GetRxErrBeforeReadFrame(enet_handle, error_statistic);
		/* update the receive buffer. */
		ENET_ReadFrame(enet_base, enet_handle, NULL, 0);
	}

    ENET_EnableInterrupts(enet_base, kENET_RxFrameInterrupt);
    return NULL;
}

