RT-Thread/rt-thread/bsp/imxrt1052-evk/drivers/drv_eth.c
static int rt_hw_imxrt_eth_init(void)
{
    rt_err_t state;

    /* OUI 00-80-E1 STMICROELECTRONICS. */
    imxrt_eth_device.dev_addr[0] = 0x00;
    imxrt_eth_device.dev_addr[1] = 0x80;
    imxrt_eth_device.dev_addr[2] = 0xE1;
    /* generate MAC addr from 96bit unique ID (only for test). */
    imxrt_eth_device.dev_addr[3] = 0x12;
    imxrt_eth_device.dev_addr[4] = 0x34;
    imxrt_eth_device.dev_addr[5] = 0x56;
    
    imxrt_eth_device.enet_base = ENET;

    imxrt_eth_device.parent.parent.init       = rt_imxrt_eth_init;
    imxrt_eth_device.parent.parent.open       = rt_imxrt_eth_open;
    imxrt_eth_device.parent.parent.close      = rt_imxrt_eth_close;
    imxrt_eth_device.parent.parent.read       = rt_imxrt_eth_read;
    imxrt_eth_device.parent.parent.write      = rt_imxrt_eth_write;
    imxrt_eth_device.parent.parent.control    = rt_imxrt_eth_control;
    imxrt_eth_device.parent.parent.user_data  = RT_NULL;

    imxrt_eth_device.parent.eth_rx     = rt_imxrt_eth_rx;
    imxrt_eth_device.parent.eth_tx     = rt_imxrt_eth_tx;

    ETH_PRINTF("sem init: tx_wait\r\n");
    /* init tx semaphore */
    rt_sem_init(&imxrt_eth_device.tx_wait, "tx_wait", 0, RT_IPC_FLAG_FIFO);

    /* register eth device */
    ETH_PRINTF("eth_device_init start\r\n");
    state = eth_device_init(&(imxrt_eth_device.parent), "e0");
    if (RT_EOK == state)
    {
        ETH_PRINTF("eth_device_init success\r\n");
    }
    else
    {
        ETH_PRINTF("eth_device_init faild: %d\r\n", state);
    }
    return state;
}
INIT_DEVICE_EXPORT(rt_hw_imxrt_eth_init);
#endif

#ifdef RT_USING_FINSH
#include <finsh.h>

void phy_read(uint32_t phyReg)
{
    uint32_t data;
    status_t status;
        
    status = PHY_Read(imxrt_eth_device.enet_base, PHY_ADDRESS, phyReg, &data);
    if (kStatus_Success == status)
    {
        rt_kprintf("PHY_Read: %02X --> %08X", phyReg, data);
    }
    else
    {
        rt_kprintf("PHY_Read: %02X --> faild", phyReg);
    }
}

void phy_write(uint32_t phyReg, uint32_t data)
{
    status_t status;
        
    status = PHY_Write(imxrt_eth_device.enet_base, PHY_ADDRESS, phyReg, data);
    if (kStatus_Success == status)
    {
        rt_kprintf("PHY_Write: %02X --> %08X\n", phyReg, data);
    }
    else
    {
        rt_kprintf("PHY_Write: %02X --> faild\n", phyReg);
    }
}

void phy_dump(void)
{
    uint32_t data;
    status_t status;
    
    int i;
    for (i = 0; i < 32; i++)
    {
        status = PHY_Read(imxrt_eth_device.enet_base, PHY_ADDRESS, i, &data);
        if (kStatus_Success != status)
        {
            rt_kprintf("phy_dump: %02X --> faild", i);
            break;
        }
        
        if (i % 8 == 7)
        {
            rt_kprintf("%02X --> %08X ", i, data);
        }
        else
        {
            rt_kprintf("%02X --> %08X\n", i, data);
        }
        
    }
}

void enet_reg_dump(void)
{
    ENET_Type *enet_base = imxrt_eth_device.enet_base;
    
#define DUMP_REG(__REG)  \
    rt_kprintf("%s(%08X): %08X\n", #__REG, (uint32_t)&enet_base->__REG, enet_base->__REG)
        
	DUMP_REG(EIR);
	DUMP_REG(EIMR);
	DUMP_REG(RDAR);
	DUMP_REG(TDAR);
	DUMP_REG(ECR);
	DUMP_REG(MMFR);
	DUMP_REG(MSCR);
	DUMP_REG(MIBC);
	DUMP_REG(RCR);
	DUMP_REG(TCR);
	DUMP_REG(PALR);
	DUMP_REG(PAUR);
	DUMP_REG(OPD);
	DUMP_REG(TXIC);
	DUMP_REG(RXIC);
	DUMP_REG(IAUR);
	DUMP_REG(IALR);
	DUMP_REG(GAUR);
	DUMP_REG(GALR);
	DUMP_REG(TFWR);
	DUMP_REG(RDSR);
	DUMP_REG(TDSR);
	DUMP_REG(MRBR);
	DUMP_REG(RSFL);
	DUMP_REG(RSEM);
	DUMP_REG(RAEM);
	DUMP_REG(RAFL);
	DUMP_REG(TSEM);
	DUMP_REG(TAEM);
	DUMP_REG(TAFL);
	DUMP_REG(TIPG);
	DUMP_REG(FTRL);
	DUMP_REG(TACC);
	DUMP_REG(RACC);
	DUMP_REG(RMON_T_DROP);
	DUMP_REG(RMON_T_PACKETS);
	DUMP_REG(RMON_T_BC_PKT);
	DUMP_REG(RMON_T_MC_PKT);
	DUMP_REG(RMON_T_CRC_ALIGN);
	DUMP_REG(RMON_T_UNDERSIZE);
	DUMP_REG(RMON_T_OVERSIZE);
	DUMP_REG(RMON_T_FRAG);
	DUMP_REG(RMON_T_JAB);
	DUMP_REG(RMON_T_COL);
	DUMP_REG(RMON_T_P64);
	DUMP_REG(RMON_T_P65TO127);
	DUMP_REG(RMON_T_P128TO255);
	DUMP_REG(RMON_T_P256TO511);
	DUMP_REG(RMON_T_P512TO1023);
	DUMP_REG(RMON_T_P1024TO2047);
	DUMP_REG(RMON_T_P_GTE2048);
	DUMP_REG(RMON_T_OCTETS);
	DUMP_REG(IEEE_T_DROP);
	DUMP_REG(IEEE_T_FRAME_OK);
	DUMP_REG(IEEE_T_1COL);
	DUMP_REG(IEEE_T_MCOL);
	DUMP_REG(IEEE_T_DEF);
	DUMP_REG(IEEE_T_LCOL);
	DUMP_REG(IEEE_T_EXCOL);
	DUMP_REG(IEEE_T_MACERR);
	DUMP_REG(IEEE_T_CSERR);
	DUMP_REG(IEEE_T_SQE);
	DUMP_REG(IEEE_T_FDXFC);
	DUMP_REG(IEEE_T_OCTETS_OK);
	DUMP_REG(RMON_R_PACKETS);
	DUMP_REG(RMON_R_BC_PKT);
	DUMP_REG(RMON_R_MC_PKT);
	DUMP_REG(RMON_R_CRC_ALIGN);
	DUMP_REG(RMON_R_UNDERSIZE);
	DUMP_REG(RMON_R_OVERSIZE);
	DUMP_REG(RMON_R_FRAG);
	DUMP_REG(RMON_R_JAB);
	DUMP_REG(RMON_R_RESVD_0);
	DUMP_REG(RMON_R_P64);
	DUMP_REG(RMON_R_P65TO127);
	DUMP_REG(RMON_R_P128TO255);
	DUMP_REG(RMON_R_P256TO511);
	DUMP_REG(RMON_R_P512TO1023);
	DUMP_REG(RMON_R_P1024TO2047);
	DUMP_REG(RMON_R_P_GTE2048);
	DUMP_REG(RMON_R_OCTETS);
	DUMP_REG(IEEE_R_DROP);
	DUMP_REG(IEEE_R_FRAME_OK);
	DUMP_REG(IEEE_R_CRC);
	DUMP_REG(IEEE_R_ALIGN);
	DUMP_REG(IEEE_R_MACERR);
	DUMP_REG(IEEE_R_FDXFC);
	DUMP_REG(IEEE_R_OCTETS_OK);
	DUMP_REG(ATCR);
	DUMP_REG(ATVR);
	DUMP_REG(ATOFF);
	DUMP_REG(ATPER);
	DUMP_REG(ATCOR);
	DUMP_REG(ATINC);
	DUMP_REG(ATSTMP);
	DUMP_REG(TGSR);
}

void enet_nvic_tog(void)
{
    NVIC_SetPendingIRQ(ENET_IRQn);
}

void enet_rx_stat(void)
{
    enet_data_error_stats_t *error_statistic = &imxrt_eth_device.error_statistic;
    
#define DUMP_STAT(__VAR)  \
    rt_kprintf("%-25s: %08X\n", #__VAR, error_statistic->__VAR);
    
    DUMP_STAT(statsRxLenGreaterErr);
    DUMP_STAT(statsRxAlignErr);
    DUMP_STAT(statsRxFcsErr);
    DUMP_STAT(statsRxOverRunErr);
    DUMP_STAT(statsRxTruncateErr);
    
#ifdef ENET_ENHANCEDBUFFERDESCRIPTOR_MODE
    DUMP_STAT(statsRxProtocolChecksumErr);
    DUMP_STAT(statsRxIpHeadChecksumErr);
    DUMP_STAT(statsRxMacErr);
    DUMP_STAT(statsRxPhyErr);
    DUMP_STAT(statsRxCollisionErr);
    DUMP_STAT(statsTxErr);
    DUMP_STAT(statsTxFrameErr);
    DUMP_STAT(statsTxOverFlowErr);
    DUMP_STAT(statsTxLateCollisionErr);
    DUMP_STAT(statsTxExcessCollisionErr);
    DUMP_STAT(statsTxUnderFlowErr);
    DUMP_STAT(statsTxTsErr);
#endif  
    
}

void enet_buf_info(void)
{

    int i = 0;
    for (i = 0; i < ENET_RXBD_NUM; i++)
    {
        rt_kprintf("%d: length: %-8d, control: %04X, buffer:%p\n", 
                    i,
                    g_rxBuffDescrip[i].length,
                    g_rxBuffDescrip[i].control,
                    g_rxBuffDescrip[i].buffer);
    }

    for (i = 0; i < ENET_TXBD_NUM; i++)
    {
        rt_kprintf("%d: length: %-8d, control: %04X, buffer:%p\n", 
                    i,
                    g_txBuffDescrip[i].length,
                    g_txBuffDescrip[i].control,
                    g_txBuffDescrip[i].buffer);
    }
}

FINSH_FUNCTION_EXPORT(phy_read, read phy register);
FINSH_FUNCTION_EXPORT(phy_write, write phy register);
FINSH_FUNCTION_EXPORT(phy_dump, dump phy registers);
FINSH_FUNCTION_EXPORT(enet_reg_dump, dump enet registers);
FINSH_FUNCTION_EXPORT(enet_nvic_tog, toggle enet nvic pendding bit);
FINSH_FUNCTION_EXPORT(enet_rx_stat, dump enet rx statistic);
FINSH_FUNCTION_EXPORT(enet_buf_info, dump enet tx and tx buffer descripter);

#endif
